def z1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                      "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                      "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                      "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                      "Северная Македония": "Скопье", "Сербия": "Белград"}
    for strana in sorted(countries_dict):
        print(strana, ' - ', countries_dict[strana])
    a = input("Введите страну: ")
    if a in countries_dict:
        print(a, ' - ', countries_dict[a])
    else:
        print('Данной страны нет в словаре!')

def z2():
    alp = { "а": 1, "б": 3, "в": 1, "г": 3, "д": 2, "е": 1,
            "ё": 3, "ж": 5, "з": 5, "и": 1, "й": 4, "к": 2,
            "л": 2, "м": 2, "н": 1, "о": 1, "п": 2, "р": 1,
            "с": 1, "т": 1, "у": 2, "ф": 10, "х": 5, "ц": 5,
            "ч": 5, "ш": 8, "щ": 10, "ъ": 10, "ы": 4, "ь": 3,
            "э": 8, "ю": 8, "я": 3}
    w = input("Введите слово: ")
    s = 0
    for i in w:
        s += alp[i.lower()]
    print(s)

def z3():
    students = [
        {"name": "Игорь", "languages": ["Русский", "Французский", "Японский"]},
        {"name": "Диана", "languages": ["Корейский", "Русский", "Английский"]},
        {"name": "Дмитрий", "languages": ["Японский", "Китайский", "Английский"]},
        {"name": "Алина", "languages": ["Китайский", "Корейский", "Русский"]}
    ]
    lang = set()
    for student in students:
        lang.update(student["languages"])

    sort = sorted(lang)
    print("Список всех языков: ", sort)

    china = []
    for student in students:
        if "Китайский" in student["languages"]:
            china.append(student["name"])
    print("Студенты, знающие китайский язык: ", china)
z1()
z2()
z3()